# pandas additional functions
# & the procedure of data analytics


## 1. data import and export

In [7]:
# import data
import pandas as pd
df=pd.read_csv('data/employees.csv')
print(type(df))
print(df.tail())
print(df.salary.mean())

# export data
df1=df.tail()
df1.to_csv('data/new.csv')

<class 'pandas.core.frame.DataFrame'>
     employee_id first_name last_name     email  phone_number      job_id  \
102          202        Pat       Fay      PFAY  603.123.6666      MK_REP
103          203      Susan    Mavris   SMAVRIS  515.123.7777      HR_REP
104          204    Hermann      Baer     HBAER  515.123.8888      PR_REP
105          205    Shelley   Higgins  SHIGGINS  515.123.8080      AC_MGR
106          206    William     Gietz    WGIETZ  515.123.8181  AC_ACCOUNT

      salary  commission_pct  manager_id  department_id
102   6000.0             NaN       201.0           20.0
103   6500.0             NaN       101.0           40.0
104  10000.0             NaN       101.0           70.0
105  12000.0             NaN       101.0          110.0
106   8300.0             NaN       205.0          110.0
6461.682242990654

In [12]:
# json
df=pd.read_json('data/data1.json')
print(type(df))
df

<class 'pandas.core.frame.DataFrame'>

   id name  age
0   1   张三   25
1   2   李四   30
2   3   王五   28

In [15]:
# problematic json
df=pd.read_json('data/test.json')
print(type(df))

import json
with open('data/test.json') as f:
    data=json.load(f)
#print(data)
print(type(data))
df=pd.DataFrame(data['users'])
df

<class 'pandas.core.frame.DataFrame'>
<class 'dict'>

   id name  age                 email  is_active   join_date
0   1  寮犱笁   28  zhangsan@example.com       True  2022-03-15
1   2  鏉庡洓   35      lisi@example.com      False  2021-11-02
2   3  鐜嬩簲   24    wangwu@example.com       True  2023-01-20


## 2. Missing data

In [4]:
# missing value
# nan: not a number
import pandas as pd
import numpy as np
s=pd.Series([12,25,np.nan,None,pd.NA])
df=pd.DataFrame([[1,pd.NA,2],[2,3,5],[None,4,6]],columns=['first column','second column','third column'])
print(s)
# check if missing
print(s.isna())
print(s.isnull())
print(df)
print(df.isna())
print(df.isnull())
print(df.isna().sum(axis=1)) # check the amount of missing value in each row
print(s.isna().sum())
print('-'*30)
# delete the missing value
print(s.dropna())
print('-'*30)
print(df)
print('-'*30)
print(df.dropna())   # if exists one missing then delete the whole record
print(df.dropna(how='all'))  # if all are missing then delete
print(df.dropna(thresh=2)) # if there are at least n none-missing value then maintain
print(df.dropna(axis=1))  # delete the whole column if it exits one missing
print(df.dropna(subset=['first column']))   # specialized columns if there exists missing then delete the row the element is in

0      12
1      25
2     NaN
3    None
4    <NA>
dtype: object
0    False
1    False
2     True
3     True
4     True
dtype: bool
0    False
1    False
2     True
3     True
4     True
dtype: bool
   first column second column  third column
0           1.0          <NA>             2
1           2.0             3             5
2           NaN             4             6
   first column  second column  third column
0         False           True         False
1         False          False         False
2          True          False         False
   first column  second column  third column
0         False           True         False
1         False          False         False
2          True          False         False
0    1
1    0
2    1
dtype: int64
3
------------------------------
0    12
1    25
dtype: object
------------------------------
   first column second column  third column
0           1.0          <NA>             2
1           2.0             3             5
2           NaN             4             6
------------------------------
   first column second column  third column
1           2.0             3             5
   first column second column  third column
0           1.0          <NA>             2
1           2.0             3             5
2           NaN             4             6
   first column second column  third column
0           1.0          <NA>             2
1           2.0             3             5
2           NaN             4             6
   third column
0             2
1             5
2             6
   first column second column  third column
0           1.0          <NA>             2
1           2.0             3             5

In [10]:
# fill up the missing values
# step 0: check dataset
df=pd.read_csv('data/weather_withna.csv')
print('example of df:\n',df.tail())
print('-'*30)
print('Number of missing values in each column:\n',df.isna().sum(axis=0))

example of df:
             date  precipitation  temp_max  temp_min  wind weather
1456  2015-12-27            NaN       NaN       NaN   NaN     NaN
1457  2015-12-28            NaN       NaN       NaN   NaN     NaN
1458  2015-12-29            NaN       NaN       NaN   NaN     NaN
1459  2015-12-30            NaN       NaN       NaN   NaN     NaN
1460  2015-12-31           20.6      12.2       5.0   3.8    rain
------------------------------
Number of missing values in each column:
 date               0
precipitation    303
temp_max         303
temp_min         303
wind             303
weather          303
dtype: int64

In [12]:
# step 1: fill up the data
print(df.fillna({'temp_max':20,'wind':25}).tail)  # use dictionary to fill up

<bound method NDFrame.tail of             date  precipitation  temp_max  temp_min  wind  weather
0     2012-01-01            0.0      12.8       5.0   4.7  drizzle
1     2012-01-02           10.9      10.6       2.8   4.5     rain
2     2012-01-03            0.8      11.7       7.2   2.3     rain
3     2012-01-04           20.3      12.2       5.6   4.7     rain
4     2012-01-05            1.3       8.9       2.8   6.1     rain
...          ...            ...       ...       ...   ...      ...
1456  2015-12-27            NaN      20.0       NaN  25.0      NaN
1457  2015-12-28            NaN      20.0       NaN  25.0      NaN
1458  2015-12-29            NaN      20.0       NaN  25.0      NaN
1459  2015-12-30            NaN      20.0       NaN  25.0      NaN
1460  2015-12-31           20.6      12.2       5.0   3.8     rain

[1461 rows x 6 columns]>

In [13]:
print(df.fillna(df[['wind']].mean()).tail())  # use mean value to fill up

            date  precipitation  temp_max  temp_min      wind weather
1456  2015-12-27            NaN       NaN       NaN  3.242055     NaN
1457  2015-12-28            NaN       NaN       NaN  3.242055     NaN
1458  2015-12-29            NaN       NaN       NaN  3.242055     NaN
1459  2015-12-30            NaN       NaN       NaN  3.242055     NaN
1460  2015-12-31           20.6      12.2       5.0  3.800000    rain

In [14]:
print(df.ffill().tail())  # use adjacent front to fill up
print(df.bfill().tail())  # use adjacent behind to fill up

            date  precipitation  temp_max  temp_min  wind weather
1456  2015-12-27            0.0      11.1       4.4   4.8     sun
1457  2015-12-28            0.0      11.1       4.4   4.8     sun
1458  2015-12-29            0.0      11.1       4.4   4.8     sun
1459  2015-12-30            0.0      11.1       4.4   4.8     sun
1460  2015-12-31           20.6      12.2       5.0   3.8    rain
            date  precipitation  temp_max  temp_min  wind weather
1456  2015-12-27           20.6      12.2       5.0   3.8    rain
1457  2015-12-28           20.6      12.2       5.0   3.8    rain
1458  2015-12-29           20.6      12.2       5.0   3.8    rain
1459  2015-12-30           20.6      12.2       5.0   3.8    rain
1460  2015-12-31           20.6      12.2       5.0   3.8    rain


## 3. Converting data types

In [15]:
import pandas as pd
data={
    "name":['alice','alice','bob','alice','jack','bob'],
    "age":[26,25,30,25,35,30],
    "city":['NY','NY','LA','NY','SF','LA']
}
df=pd.DataFrame(data)
df

    name  age city
0  alice   26   NY
1  alice   25   NY
2    bob   30   LA
3  alice   25   NY
4   jack   35   SF
5    bob   30   LA

In [20]:
print(df.duplicated())   # whole record check duplicate
print(df.drop_duplicates(subset=['name']))  # drop duplicates with assigned column using index
print(df.drop_duplicates(subset=['name'],keep='last')) # drop duplicates, and remain the last record

0    False
1    False
2    False
3     True
4    False
5     True
dtype: bool
    name  age city
0  alice   26   NY
2    bob   30   LA
4   jack   35   SF
    name  age city
3  alice   25   NY
4   jack   35   SF
5    bob   30   LA

In [21]:
# converting data types
df=pd.read_csv('data/sleep.csv')
df.dtypes

person_id                    int64
gender                      object
age                          int64
occupation                  object
sleep_duration             float64
sleep_quality              float64
physical_activity_level      int64
stress_level                 int64
bmi_category                object
blood_pressure              object
heart_rate                   int64
daily_steps                  int64
sleep_disorder              object
dtype: object

In [22]:
df['age']=df['age'].astype('int16')
df.dtypes

person_id                    int64
gender                      object
age                          int16
occupation                  object
sleep_duration             float64
sleep_quality              float64
physical_activity_level      int64
stress_level                 int64
bmi_category                object
blood_pressure              object
heart_rate                   int64
daily_steps                  int64
sleep_disorder              object
dtype: object

In [24]:
df['gender']=df['gender'].astype('category')
df.gender

0        Male
1      Female
2        Male
3        Male
4        Male
        ...
395    Female
396    Female
397    Female
398    Female
399      Male
Name: gender, Length: 400, dtype: category
Categories (2, object): ['Female', 'Male']


## 4. Change shape of data

In [26]:
import pandas as pd
data={
    'ID':[1,2],
    'name':['alice','bob'],
    'Math':[90,85],
    'English':[88,92],
    'Science':[95,89]
}
df=pd.DataFrame(data)
df.T
df

   ID   name  Math  English  Science
0   1  alice    90       88       95
1   2    bob    85       92       89

In [30]:
# table convert: wide into long
df2=pd.melt(df,id_vars=['ID','name'],var_name='Subject',value_name='Score')
df2.sort_values('name')

   ID   name  Subject  Score
0   1  alice     Math     90
2   1  alice  English     88
4   1  alice  Science     95
1   2    bob     Math     85
3   2    bob  English     92
5   2    bob  Science     89

In [31]:
# table convert: long into wide
pd.pivot(df2,index=['ID','name'],columns='Subject',values='Score')

Subject   English  Math  Science
ID name
1  alice       88    90       95
2  bob         92    85       89

In [32]:
data={
    'ID':[1,2],
    'name':['alice smith','bob smith'],
    'Math':[90,85],
    'English':[88,92],
    'Science':[95,89]
}
df=pd.DataFrame(data)
df

   ID         name  Math  English  Science
0   1  alice smith    90       88       95
1   2    bob smith    85       92       89

In [34]:
# split data
df[['first name','last name']]=df['name'].str.split(" ",expand=True)
df

   ID         name  Math  English  Science first name last name
0   1  alice smith    90       88       95      alice     smith
1   2    bob smith    85       92       89        bob     smith

In [40]:
df=pd.read_csv('data/sleep.csv')
print(df.head())
df=df[['person_id','blood_pressure']]
df[['high','low']]=df['blood_pressure'].str.split('/',expand=True)
df['high']=df['high'].astype('int64')
df['low']=df['low'].astype('int64')
df.info()
df.high.mean()
df.low.mean()

   person_id  gender  age     occupation  sleep_duration  sleep_quality  \
0          1    Male   29   Manual Labor             7.4            7.0
1          2  Female   43        Retired             4.2            4.9
2          3    Male   44        Retired             6.1            6.0
3          4    Male   29  Office Worker             8.3           10.0
4          5    Male   67        Retired             9.1            9.5

   physical_activity_level  stress_level bmi_category blood_pressure  \
0                       41             7        Obese         124/70
1                       41             5        Obese         131/86
2                      107             4  Underweight         122/70
3                       20            10        Obese         124/72
4                       19             4   Overweight         133/78

   heart_rate  daily_steps sleep_disorder
0          91         8539            NaN
1          81        18754            NaN
2          81         2857            NaN
3          55         6886            NaN
4          97        14945       Insomnia
<class 'pandas.core.frame.DataFrame'>
RangeIndex: 400 entries, 0 to 399
Data columns (total 4 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   person_id       400 non-null    int64
 1   blood_pressure  400 non-null    object
 2   high            400 non-null    int64
 3   low             400 non-null    int64
dtypes: int64(3), object(1)
memory usage: 12.6+ KB

np.float64(73.04)


## 5. Data binning

In [1]:
# pd.cut(x,bins,labels)
import pandas as pd
df=pd.read_csv('data/employees.csv')
df.head()

,employee_id,first_name,last_name,email,phone_number,job_id,salary,commission_pct,manager_id,department_id
0,100,Steven,King,SKING,515.123.4567,AD_PRES,24000.0,NaN,NaN,90.0
1,101,N_ann,Kochhar,NKOCHHAR,515.123.4568,AD_VP,17000.0,NaN,100.0,90.0
2,102,Lex,De Haan,LDEHAAN,515.123.4569,AD_VP,17000.0,NaN,100.0,90.0
3,103,Alexander,Hunold,AHUNOLD,590.423.4567,IT_PROG,9000.0,NaN,102.0,60.0
4,104,Bruce,Ernst,BERNST,590.423.4568,IT_PROG,6000.0,NaN,103.0,60.0

In [2]:
df1=df.head(10)[['employee_id','salary']]
df1

   employee_id   salary
0          100  24000.0
1          101  17000.0
2          102  17000.0
3          103   9000.0
4          104   6000.0
5          105   4800.0
6          106   4800.0
7          107   4200.0
8          108  12000.0
9          109   9000.0

In [5]:
pd.cut(df1['salary'],bins=2) # bins=n, split into n sections, the starting value is the smallest and the ending value is the largest in the dataset
pd.cut(df1['salary'],bins=2).value_counts()

salary
(4180.2, 14100.0]     7
(14100.0, 24000.0]    3
Name: count, dtype: int64

In [8]:
df1['salary range']=pd.cut(df1['salary'],bins=[0,10000,20000,30000],labels=['low','medium','high'])  # bins=list, split into n sections
df1

   employee_id   salary salary range
0          100  24000.0         high
1          101  17000.0       medium
2          102  17000.0       medium
3          103   9000.0          low
4          104   6000.0          low
5          105   4800.0          low
6          106   4800.0          low
7          107   4200.0          low
8          108  12000.0       medium
9          109   9000.0          low

In [9]:
pd.qcut(df1['salary'],3).value_counts()  # split by the data point(every section has the same data points)

salary
(12000.0, 24000.0]    4
(4199.999, 6000.0]    3
(6000.0, 12000.0]     3
Name: count, dtype: int64

In [20]:
# example
df=pd.read_csv('data/sleep.csv')
df
df1=df.head(10)[['person_id','sleep_quality']]
df1
df['sleeping quality']=pd.cut(df['sleep_quality'],bins=3,labels=['good','average','bad'])
df['sleeping quality'].value_counts()
df.head(10)
df['gender']=df['gender'].astype('category')
df['gender'].value_counts()
#  string-> category-> analysis
#  value-> bin-> anlysis
print(df['gender'].dtype)
print(df['sleeping quality'].dtype)

category
category

In [23]:
# df.rename()
df=pd.DataFrame({
    'name':['jack','alice','tom','bob'],
    'age':[20,30,40,50],
    'gender':['female','male','female','male']
})
df.set_index("name",inplace=True)
print(df)
df.reset_index(inplace=True)
print('-'*30,'\n',df)
# df.set_index()
# df.reset_index()
df.rename(columns={"age":"Age"},index={0:4})

       age  gender
name
jack    20  female
alice   30    male
tom     40  female
bob     50    male
------------------------------
     name  age  gender
0   jack   20  female
1  alice   30    male
2    tom   40  female
3    bob   50    male

    name  Age  gender
4   jack   20  female
1  alice   30    male
2    tom   40  female
3    bob   50    male


## 6. Time data

In [32]:
import pandas as pd
# basic attributes
d=pd.Timestamp('2025-05-02 10:22')
d1=pd.Timestamp('2025-05-02 13:22')
print(d)
print(type(d))
print("year:",d.year)
print("month:",d.month)
print("day:",d.day)
print(d.hour,d.minute,d.second)
print("season:",d.quarter)
print("is end of month:",d.is_month_end)

# method
print("day in week:",d.day_name())
print("turn into day:",d.to_period("D"))
print("turn into day:",d1.to_period("D"))
print("turn into quarter:",d1.to_period("Q"))
print("turn into year:",d1.to_period("Y"))
print("turn into month:",d1.to_period("M"))
print("turn into week:",d1.to_period("W"))

2025-05-02 10:22:00
<class 'pandas._libs.tslibs.timestamps.Timestamp'>
year: 2025
month: 5
day: 2
10 22 0
season: 2
is end of month: False
day in week: Friday
turn into day: 2025-05-02
turn into day: 2025-05-02
turn into quarter: 2025Q2
turn into year: 2025
turn into month: 2025-05
turn into week: 2025-04-28/2025-05-04

In [34]:
# string convert to date type
a=pd.to_datetime('2025-2-28')
print(a)
print(type(a))
print(a.day_name())

2025-02-28 00:00:00
<class 'pandas._libs.tslibs.timestamps.Timestamp'>
Friday

In [35]:
# DataFrame convert to date type
df=pd.DataFrame({
    'sales':[100,200,300],
    'date':['20250601','20250602','20250603']
})
df['datetime']=pd.to_datetime(df['date'])
df

   sales      date   datetime
0    100  20250601 2025-06-01
1    200  20250602 2025-06-02
2    300  20250603 2025-06-03

In [40]:
print(df.info())
print(type(df['datetime']))
df['week']=df['datetime'].dt.day_name()  # .dt is accessor for datetime type
df

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3 entries, 0 to 2
Data columns (total 4 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   sales     3 non-null      int64
 1   date      3 non-null      object
 2   datetime  3 non-null      datetime64[ns]
 3   week      0 non-null      object
dtypes: datetime64[ns](1), int64(1), object(2)
memory usage: 228.0+ bytes
None
<class 'pandas.core.series.Series'>

   sales      date   datetime     week
0    100  20250601 2025-06-01   Sunday
1    200  20250602 2025-06-02   Monday
2    300  20250603 2025-06-03  Tuesday

In [45]:
# csv date convert
# df=pd.read_csv('data/weather.csv')
# print(df.info())
# print('-'*30)
# df['datetime']=pd.to_datetime(df['date'])
# df['datetime'].dt.day_name()
df=pd.read_csv('data/weather.csv',parse_dates=['date'])
df.info()
df['date'].dt.day_name()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1461 entries, 0 to 1460
Data columns (total 6 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   date           1461 non-null   datetime64[ns]
 1   precipitation  1461 non-null   float64
 2   temp_max       1461 non-null   float64
 3   temp_min       1461 non-null   float64
 4   wind           1461 non-null   float64
 5   weather        1461 non-null   object
dtypes: datetime64[ns](1), float64(4), object(1)
memory usage: 68.6+ KB

0          Sunday
1          Monday
2         Tuesday
3       Wednesday
4        Thursday
          ...
1456       Sunday
1457       Monday
1458      Tuesday
1459    Wednesday
1460     Thursday
Name: date, Length: 1461, dtype: object

In [49]:
# date data as index
#df.set_index('date',inplace=True)
print(df)
print(df.loc['2013-01':'2013-02'])

            precipitation  temp_max  temp_min  wind  weather
date
2012-01-01            0.0      12.8       5.0   4.7  drizzle
2012-01-02           10.9      10.6       2.8   4.5     rain
2012-01-03            0.8      11.7       7.2   2.3     rain
2012-01-04           20.3      12.2       5.6   4.7     rain
2012-01-05            1.3       8.9       2.8   6.1     rain
...                   ...       ...       ...   ...      ...
2015-12-27            8.6       4.4       1.7   2.9     rain
2015-12-28            1.5       5.0       1.7   1.3     rain
2015-12-29            0.0       7.2       0.6   2.6      fog
2015-12-30            0.0       5.6      -1.0   3.4      sun
2015-12-31            0.0       5.6      -2.1   3.5      sun

[1461 rows x 5 columns]
            precipitation  temp_max  temp_min  wind  weather
date
2013-01-01            0.0       5.0      -2.8   2.7      sun
2013-01-02            0.0       6.1      -1.1   3.2      sun
2013-01-03            4.1       6.7      -1.7   3.0     rain
2013-01-04            2.5      10.0       2.2   2.8     rain
2013-01-05            3.0       6.7       4.4   3.1     rain
2013-01-06            2.0       7.2       2.8   3.0     rain
2013-01-07            2.3      10.0       4.4   7.3     rain
2013-01-08           16.3      11.7       5.6   6.3     rain
2013-01-09           38.4      10.0       1.7   5.1     rain
2013-01-10            0.3       3.3      -0.6   2.1     snow
2013-01-11            0.0       2.8      -2.8   1.9  drizzle
2013-01-12            0.0       2.8      -3.9   2.0      sun
2013-01-13            0.0       2.2      -4.4   1.5      sun
2013-01-14            0.0       3.3      -2.2   1.3      sun
2013-01-15            0.0       6.7      -0.6   2.3      sun
2013-01-16            0.0       6.1      -3.9   1.8  drizzle
2013-01-17            0.0       3.9      -2.8   1.0  drizzle
2013-01-18            0.0       3.3      -1.1   1.3  drizzle
2013-01-19            0.0       1.1      -0.6   1.9  drizzle
2013-01-20            0.0       3.3      -0.6   2.1  drizzle
2013-01-21            0.0       2.2      -1.7   1.1  drizzle
2013-01-22            0.0       3.3      -1.7   0.6  drizzle
2013-01-23            5.1       7.2       2.2   3.1     rain
2013-01-24            5.8       7.2       1.1   2.6     rain
2013-01-25            3.0      10.6       2.8   2.1     rain
2013-01-26            2.3       8.3       3.9   4.5     rain
2013-01-27            1.8       5.6       3.9   4.5     rain
2013-01-28            7.9       6.1       3.3   3.2     rain
2013-01-29            4.3       8.3       5.0   3.9     rain
2013-01-30            3.6       8.9       6.7   3.9     rain
2013-01-31            3.0       9.4       7.2   4.0     rain
2013-02-01            0.3      11.7       5.0   2.9     rain
2013-02-02            0.0       6.1       2.8   2.0  drizzle
2013-02-03            2.3       8.9       2.8   2.9     rain
2013-02-04            0.0      10.6       6.7   2.6     rain
2013-02-05            3.3      10.0       6.7   5.1     rain
2013-02-06            1.0      10.6       6.1   4.5     rain
2013-02-07            1.3       9.4       3.3   4.1     rain
2013-02-08            0.0       7.8       2.2   1.3      sun
2013-02-09            0.3       8.3       4.4   1.3     rain
2013-02-10            0.0       8.9       1.7   2.0  drizzle
2013-02-11            0.3       8.3       4.4   1.4     rain
2013-02-12            1.0      11.1       7.2   5.6     rain
2013-02-13            2.3       9.4       7.2   4.1     rain
2013-02-14            1.0       9.4       5.6   2.2     rain
2013-02-15            0.0      13.3       5.0   2.4  drizzle
2013-02-16            0.0      11.1       3.9   5.6     rain
2013-02-17            0.0       9.4       4.4   3.4     rain
2013-02-18            0.0       7.8       3.9   1.9     rain
2013-02-19            0.0      10.6       1.7   3.4      sun
2013-02-20            1.5       7.8       1.1   2.1     rain
2013-02-21            0.5       6.7       3.9   6.2     rain
2013-02-22            9.4       7.8       3.9   8.1     rain
2013-02-23            0.3      10.0       3.9   4.6     rain
2013-02-24            0.0       8.9       5.0   5.5     rain
2013-02-25            2.3      10.6       3.3   7.1     rain
2013-02-26            0.5       8.9       3.9   3.8     rain
2013-02-27            4.6      10.0       4.4   1.8     rain
2013-02-28            8.1      11.7       6.7   3.8     rain

In [50]:
# time interval
d1=pd.Timestamp('2013-01-15')
d2=pd.Timestamp('2023-02-23')
d3=d2-d1
print(type(d3))
print(d3)

<class 'pandas._libs.tslibs.timedeltas.Timedelta'>
3691 days 00:00:00

In [54]:
df=pd.read_csv('data/weather.csv',parse_dates=['date'])
df.info()
df['delta']=df['date']-df['date'][0]
df
df.set_index('delta',inplace=True)
df

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1461 entries, 0 to 1460
Data columns (total 6 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   date           1461 non-null   datetime64[ns]
 1   precipitation  1461 non-null   float64
 2   temp_max       1461 non-null   float64
 3   temp_min       1461 non-null   float64
 4   wind           1461 non-null   float64
 5   weather        1461 non-null   object
dtypes: datetime64[ns](1), float64(4), object(1)
memory usage: 68.6+ KB

                date  precipitation  temp_max  temp_min  wind  weather
delta
0 days    2012-01-01            0.0      12.8       5.0   4.7  drizzle
1 days    2012-01-02           10.9      10.6       2.8   4.5     rain
2 days    2012-01-03            0.8      11.7       7.2   2.3     rain
3 days    2012-01-04           20.3      12.2       5.6   4.7     rain
4 days    2012-01-05            1.3       8.9       2.8   6.1     rain
...              ...            ...       ...       ...   ...      ...
1456 days 2015-12-27            8.6       4.4       1.7   2.9     rain
1457 days 2015-12-28            1.5       5.0       1.7   1.3     rain
1458 days 2015-12-29            0.0       7.2       0.6   2.6      fog
1459 days 2015-12-30            0.0       5.6      -1.0   3.4      sun
1460 days 2015-12-31            0.0       5.6      -2.1   3.5      sun

[1461 rows x 6 columns]

In [56]:
print(df.loc['10 days':'20 days'])

              date  precipitation  temp_max  temp_min  wind weather
delta
10 days 2012-01-11            0.0       6.1      -1.1   5.1     sun
11 days 2012-01-12            0.0       6.1      -1.7   1.9     sun
12 days 2012-01-13            0.0       5.0      -2.8   1.3     sun
13 days 2012-01-14            4.1       4.4       0.6   5.3    snow
14 days 2012-01-15            5.3       1.1      -3.3   3.2    snow
15 days 2012-01-16            2.5       1.7      -2.8   5.0    snow
16 days 2012-01-17            8.1       3.3       0.0   5.6    snow
17 days 2012-01-18           19.8       0.0      -2.8   5.0    snow
18 days 2012-01-19           15.2      -1.1      -2.8   1.6    snow
19 days 2012-01-20           13.5       7.2      -1.1   2.3    snow
20 days 2012-01-21            3.0       8.3       3.3   8.2    rain

In [60]:
days=pd.date_range("2025-07-03","2026-02-09",freq="W")
days2=pd.date_range("2025-07-03",periods=10,freq="YE")
print(days)
print(days2)

DatetimeIndex(['2025-07-06', '2025-07-13', '2025-07-20', '2025-07-27',
               '2025-08-03', '2025-08-10', '2025-08-17', '2025-08-24',
               '2025-08-31', '2025-09-07', '2025-09-14', '2025-09-21',
               '2025-09-28', '2025-10-05', '2025-10-12', '2025-10-19',
               '2025-10-26', '2025-11-02', '2025-11-09', '2025-11-16',
               '2025-11-23', '2025-11-30', '2025-12-07', '2025-12-14',
               '2025-12-21', '2025-12-28', '2026-01-04', '2026-01-11',
               '2026-01-18', '2026-01-25', '2026-02-01', '2026-02-08'],
              dtype='datetime64[ns]', freq='W-SUN')
DatetimeIndex(['2025-12-31', '2026-12-31', '2027-12-31', '2028-12-31',
               '2029-12-31', '2030-12-31', '2031-12-31', '2032-12-31',
               '2033-12-31', '2034-12-31'],
              dtype='datetime64[ns]', freq='YE-DEC')

In [62]:
df=pd.read_csv('data/weather.csv',parse_dates=['date'])
# resampling
df.set_index('date',inplace=True)

In [63]:
df[["temp_max","temp_min"]].resample("YE").mean()

             temp_max  temp_min
date
2012-12-31  15.276776  7.289617
2013-12-31  16.058904  8.153973
2014-12-31  16.995890  8.662466
2015-12-31  17.427945  8.835616


## 7. Group and Aggregation

In [75]:
# df.groupby('group')['aggregate'].aggregate_function()
import pandas as pd
df=pd.read_csv('data/employees.csv')
print(df['department_id'].isna().sum())
df=df.dropna(subset=['department_id'])
df['department_id']=df['department_id'].astype('int64')

# calculate the average salary in each department
df.groupby('department_id').groups  # check all the groups
df.groupby('department_id').get_group(20)  # check specific group data
df2=df.groupby('department_id')[['salary']].mean()
df2['salary']=df2['salary'].round(2)
df2=df2.reset_index()
df2.sort_values('salary',ascending=False)

1

    department_id    salary
8              90  19333.33
10            110  10150.00
6              70  10000.00
1              20   9500.00
7              80   8955.88
9             100   8600.00
3              40   6500.00
5              60   5760.00
0              10   4400.00
2              30   4150.00
4              50   3475.56

In [80]:
# average salary group by department and job_id
df2=df.groupby(['department_id','job_id'])['salary'].mean()
df2=df2.reset_index()
df2['salary']=df2['salary'].round(1)
df2.sort_values('salary',ascending=False)

    department_id      job_id   salary
13             90     AD_PRES  24000.0
14             90       AD_VP  17000.0
1              20      MK_MAN  13000.0
11             80      SA_MAN  12200.0
16            100      FI_MGR  12000.0
18            110      AC_MGR  12000.0
4              30      PU_MAN  11000.0
10             70      PR_REP  10000.0
12             80      SA_REP   8396.6
17            110  AC_ACCOUNT   8300.0
15            100  FI_ACCOUNT   7920.0
8              50      ST_MAN   7280.0
5              40      HR_REP   6500.0
2              20      MK_REP   6000.0
9              60     IT_PROG   5760.0
0              10     AD_ASST   4400.0
6              50    SH_CLERK   3215.0
7              50    ST_CLERK   2785.0
3              30    PU_CLERK   2780.0

## 8.Question sets

### (1) penguin weight analysis

steps:

- import libraries

- import data

- data cleaning

- data features and create new structure

- analysis

In [81]:
# 1.import libraries
import pandas as pd
# 2.import data
df=pd.read_csv('data/penguins.csv')
df.head()
df.info()

,species,island,bill_length_mm,bill_depth_mm,flipper_length_mm,body_mass_g,sex
0,Adelie,Torgersen,39.1,18.7,181.0,3750.0,Male
1,Adelie,Torgersen,39.5,17.4,186.0,3800.0,Female
2,Adelie,Torgersen,40.3,18.0,195.0,3250.0,Female
3,Adelie,Torgersen,NaN,NaN,NaN,NaN,NaN
4,Adelie,Torgersen,36.7,19.3,193.0,3450.0,Female

In [82]:
# 3.data cleaning
# check invalid data
print(df.isna().sum())
df.dropna(inplace=True)

species               0
island                0
bill_length_mm        2
bill_depth_mm         2
flipper_length_mm     2
body_mass_g           2
sex                  11
dtype: int64

In [85]:
df.head()

,species,island,bill_length_mm,bill_depth_mm,flipper_length_mm,body_mass_g,sex
0,Adelie,Torgersen,39.1,18.7,181.0,3750.0,Male
1,Adelie,Torgersen,39.5,17.4,186.0,3800.0,Female
2,Adelie,Torgersen,40.3,18.0,195.0,3250.0,Female
4,Adelie,Torgersen,36.7,19.3,193.0,3450.0,Female
5,Adelie,Torgersen,39.3,20.6,190.0,3650.0,Male

In [86]:
# 4.data features and create new structure
df['sex']=df['sex'].astype('category')
df['bill_ratio']=df['bill_length_mm']/df['bill_depth_mm']

In [89]:
# 5. analysis
# binning: three level of weight
labels=['low','medium','high']
df['mass_level']=pd.cut(df['body_mass_g'],bins=3,labels=labels)
print(df['mass_level'].value_counts())
df.head()

mass_level
low       150
medium    128
high       55
Name: count, dtype: int64

,species,island,bill_length_mm,bill_depth_mm,flipper_length_mm,body_mass_g,sex,bill_ratio,mass_level
0,Adelie,Torgersen,39.1,18.7,181.0,3750.0,Male,2.090909,low
1,Adelie,Torgersen,39.5,17.4,186.0,3800.0,Female,2.270115,low
2,Adelie,Torgersen,40.3,18.0,195.0,3250.0,Female,2.238889,low
4,Adelie,Torgersen,36.7,19.3,193.0,3450.0,Female,1.901554,low
5,Adelie,Torgersen,39.3,20.6,190.0,3650.0,Male,1.907767,low

In [94]:
# group by island and gender
df.groupby(['sex','island']).agg({
    'body_mass_g':['mean','count']
})

C:\Users\CHMEI\AppData\Local\Temp\ipykernel_30524\1951707707.py:2: FutureWarning: The default of observed=False is deprecated and will be changed to True in a future version of pandas. Pass observed=False to retain current behavior or observed=True to adopt the future default and silence this warning.
  df.groupby(['sex','island']).agg({

                  body_mass_g
                         mean count
sex    island
Female Biscoe     4319.375000    80
       Dream      3446.311475    61
       Torgersen  3395.833333    24
Male   Biscoe     5104.518072    83
       Dream      3987.096774    62
       Torgersen  4034.782609    23

### (2) sleeping time analysis

In [95]:
# 1.import libraries
import pandas as pd
import numpy as np
# 2.import data
df=pd.read_csv('data/sleep.csv')
df.head()
df.info()
df.describe()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 400 entries, 0 to 399
Data columns (total 13 columns):
 #   Column                   Non-Null Count  Dtype
---  ------                   --------------  -----
 0   person_id                400 non-null    int64
 1   gender                   400 non-null    object
 2   age                      400 non-null    int64
 3   occupation               400 non-null    object
 4   sleep_duration           400 non-null    float64
 5   sleep_quality            400 non-null    float64
 6   physical_activity_level  400 non-null    int64
 7   stress_level             400 non-null    int64
 8   bmi_category             400 non-null    object
 9   blood_pressure           400 non-null    object
 10  heart_rate               400 non-null    int64
 11  daily_steps              400 non-null    int64
 12  sleep_disorder           110 non-null    object
dtypes: float64(2), int64(6), object(5)
memory usage: 40.8+ KB

,person_id,age,sleep_duration,sleep_quality,physical_activity_level,stress_level,heart_rate,daily_steps
count,400.000000,400.000000,400.000000,400.000000,400.000000,400.00000,400.000000,400.000000
mean,200.500000,39.950000,8.041250,6.125750,64.985000,5.47250,75.990000,11076.510000
std,115.614301,14.038883,2.390787,1.975733,32.297874,2.80873,15.099334,5364.789364
min,1.000000,18.000000,4.100000,1.000000,10.000000,1.00000,50.000000,2067.000000
25%,100.750000,29.000000,5.900000,4.700000,35.000000,3.00000,63.000000,6165.250000
50%,200.500000,40.000000,8.200000,6.100000,65.500000,5.00000,77.000000,11785.500000
75%,300.250000,49.000000,10.125000,7.425000,94.000000,8.00000,90.000000,15878.000000
max,400.000000,90.000000,12.000000,10.000000,120.000000,10.00000,100.000000,19958.000000

In [99]:
# 3.data cleaning
df.isna().sum()
df['sleep_disorder'].value_counts()
df.drop(columns='sleep_disorder',inplace=True)

In [101]:
df.head()
df.isna().sum()

person_id                  0
gender                     0
age                        0
occupation                 0
sleep_duration             0
sleep_quality              0
physical_activity_level    0
stress_level               0
bmi_category               0
blood_pressure             0
heart_rate                 0
daily_steps                0
dtype: int64

In [108]:
# 4.data features and create new structure
df['gender']=df['gender'].astype('category')
df['occupation']=df['occupation'].astype('category')
df['bmi_category']=df['bmi_category'].astype('category')
df[['high','low']]=df['blood_pressure'].str.split('/',expand=True)
df.head()
# bining sleeping quality
labels=['bad','average','good']
df['quality_level']=pd.cut(df['sleep_quality'],bins=3,labels=labels)
age_labels=['young','senior','old']
df['age_level']=pd.cut(df['age'],bins=3,labels=age_labels)
df.head()

,person_id,gender,age,occupation,sleep_duration,sleep_quality,physical_activity_level,stress_level,bmi_category,blood_pressure,heart_rate,daily_steps,high,low,quality_level,age_level
0,1,Male,29,Manual Labor,7.4,7.0,41,7,Obese,124/70,91,8539,124,70,average,young
1,2,Female,43,Retired,4.2,4.9,41,5,Obese,131/86,81,18754,131,86,average,senior
2,3,Male,44,Retired,6.1,6.0,107,4,Underweight,122/70,81,2857,122,70,average,senior
3,4,Male,29,Office Worker,8.3,10.0,20,10,Obese,124/72,55,6886,124,72,good,young
4,5,Male,67,Retired,9.1,9.5,19,4,Overweight,133/78,97,14945,133,78,good,old

In [109]:
# 5.analysis
print(df['bmi_category'].value_counts())

bmi_category
Overweight     109
Underweight    102
Obese           98
Normal          91
Name: count, dtype: int64

In [113]:
# group by different bmi
df.groupby(['age_level','bmi_category']).agg({
    'sleep_duration':'mean',
    'sleep_quality':'mean',
    'stress_level':'mean'
})

C:\Users\CHMEI\AppData\Local\Temp\ipykernel_30524\2966071343.py:2: FutureWarning: The default of observed=False is deprecated and will be changed to True in a future version of pandas. Pass observed=False to retain current behavior or observed=True to adopt the future default and silence this warning.
  df.groupby(['age_level','bmi_category']).agg({

                        sleep_duration  sleep_quality  stress_level
age_level bmi_category
young     Normal              8.100000       6.332000      4.860000
          Obese               8.250000       6.253448      5.534483
          Overweight          8.214286       6.171429      5.317460
          Underweight         7.603279       5.883607      5.426230
senior    Normal              7.422222       6.650000      4.944444
          Obese               7.805556       6.216667      5.888889
          Overweight          8.246154       5.956410      5.974359
          Underweight         8.497500       5.907500      5.750000
old       Normal              7.420000       4.240000      4.200000
          Obese               7.900000       5.025000      8.000000
          Overweight          8.971429       6.285714      6.714286
          Underweight        10.500000       6.200000      6.000000